#  (Extra) Organizando dataframes

In [1]:
import pandas as pd

In [2]:
data = [[1,2,3],[4,5,6],[7,8,9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [5]:
list('123')

['1', '2', '3']

In [12]:
df = pd.DataFrame(data, list('321'), list('ZYX'))
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [14]:
# Ordena os dados pelo index
df.sort_index(inplace = True)
df

   Z  Y  X
1  7  8  9
2  4  5  6
3  1  2  3

Se precisar ordenar os dados pelos atributos basta passar o parâmetro **axis=1**

In [16]:
df.sort_index(inplace = True, axis=1)
df

   X  Y  Z
1  9  8  7
2  6  5  4
3  3  2  1

Caso seja necessário ordenar pelos dados de uma coluna?

usamos a função **.sort_values** passando por parâmetro qual o atributo desejamos ordenar **by = 'X'**.  Também é possível ordenar por mais de uma coluna passando uma lista ex: **by = ['X', 'Y']**.

In [18]:
df.sort_values(by = 'X', inplace = True)
df

   X  Y  Z
3  3  2  1
2  6  5  4
1  9  8  7

No lugar da função **.sort_index()** podemos adicionar o parâmetro **axis = 1** e no **by = '3'** definir um indice, as colunas serão ordenadas pelos valores.

In [25]:
df.sort_values(by = '3', axis = 1, inplace=True)
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9